zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/LPC55S69/LPC55S69_cm33_core0.xml
        <register>
          <name>STARTERCLR0</name>
          <description>Clear bits in STARTER</description>
          <addressOffset>0x6C0</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xF97FFFFF</resetMask>
          <fields>
            <field>
              <name>SYS_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SDMA0_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_GLOBALINT0_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_GLOBALINT1_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_INT00_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_INT01_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_INT02_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_INT03_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>UTICK0_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MRT0_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CTIMER0_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CTIMER1_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SCT0_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CTIMER3_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FLEXINT0_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FLEXINT1_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FLEXINT2_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FLEXINT3_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FLEXINT4_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FLEXINT5_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FLEXINT6_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FLEXINT7_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC0_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC0_THCMP_OVR_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>USB0_NEEDCLK_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>USB0_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RTC_LITE0_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EZH_ARCH_B0_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WAKEUP_MAILBOX0_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STARTERCLR1</name>
          <description>Clear bits in STARTER</description>
          <addressOffset>0x6C4</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x8FFF847F</resetMask>
          <fields>
            <field>
              <name>GPIO_INT04_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_INT05_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_INT06_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_INT07_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CTIMER2_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CTIMER4_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OS_EVENT_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SDIO_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>USB1_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>USB1_NEEDCLK_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEC_HYPERVISOR_CALL_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEC_GPIO_INT00_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEC_GPIO_INT01_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PLU_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEC_VIO_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SHA_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CASER_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>QDDKEY_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PQ_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SDMA1_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LSPI_HS_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WAKEUPPADS_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HARDWARESLEEP</name>
          <description>Hardware Sleep control</description>
          <addressOffset>0x780</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x2B</resetMask>
          <fields>
            <field>
              <name>FORCED</name>
              <description>Force peripheral clocking to stay on during Deep Sleep and Power-down modes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PERIPHERALS</name>
              <description>Wake for Flexcomms.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDMA0</name>
              <description>Wake for DMA0.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDMA1</name>
              <description>Wake for DMA1.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUCTRL</name>
          <description>CPU Control for multiple processors</description>
          <addressOffset>0x800</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2C</resetValue>
          <resetMask>0x3D</resetMask>
          <fields>
            <field>
              <name>CPU1CLKEN</name>
              <description>CPU1 clock enable.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The CPU1 clock is not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The CPU1 clock is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU1RSTEN</name>
              <description>CPU1 reset.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RELEASED</name>
                  <description>The CPU1 is not being reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>The CPU1 is being reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPBOOT</name>
          <description>Coprocessor Boot Address</description>
          <addressOffset>0x804</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPBOOT</name>
              <description>Coprocessor Boot Address for CPU1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPSTACK</name>
          <description>Coprocessor Stack Address</description>
          <addressOffset>0x808</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPSTACK</name>
              <description>Coprocessor Stack Address. -- NOT USED</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
