zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/LPC55S69/LPC55S69_cm33_core0.xml
        <register>
          <name>SEC_CTRL_AHB0_0_SLAVE_RULE</name>
          <description>Security access rules for AHB peripherals.</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMA0_RULE</name>
              <description>no description available</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_NS_NP</name>
                  <description>Non-secure and Non-priviledge user access allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_P</name>
                  <description>Non-secure and Privilege access allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_NP</name>
                  <description>Secure and Non-priviledge user access allowed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_P</name>
                  <description>Secure and Priviledge user access allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FS_USB_DEV_RULE</name>
              <description>no description available</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_NS_NP</name>
                  <description>Non-secure and Non-priviledge user access allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_P</name>
                  <description>Non-secure and Privilege access allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_NP</name>
                  <description>Secure and Non-priviledge user access allowed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_P</name>
                  <description>Secure and Priviledge user access allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCT_RULE</name>
              <description>no description available</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_NS_NP</name>
                  <description>Non-secure and Non-priviledge user access allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_P</name>
                  <description>Non-secure and Privilege access allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_NP</name>
                  <description>Secure and Non-priviledge user access allowed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_P</name>
                  <description>Secure and Priviledge user access allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXCOMM0_RULE</name>
              <description>no description available</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_NS_NP</name>
                  <description>Non-secure and Non-priviledge user access allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_P</name>
                  <description>Non-secure and Privilege access allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_NP</name>
                  <description>Secure and Non-priviledge user access allowed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_P</name>
                  <description>Secure and Priviledge user access allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXCOMM1_RULE</name>
              <description>no description available</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_NS_NP</name>
                  <description>Non-secure and Non-priviledge user access allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_P</name>
                  <description>Non-secure and Privilege access allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_NP</name>
                  <description>Secure and Non-priviledge user access allowed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_P</name>
                  <description>Secure and Priviledge user access allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_CTRL_AHB0_1_SLAVE_RULE</name>
          <description>Security access rules for AHB peripherals.</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLEXCOMM2_RULE</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_NS_NP</name>
                  <description>Non-secure and Non-priviledge user access allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_P</name>
                  <description>Non-secure and Privilege access allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_NP</name>
                  <description>Secure and Non-priviledge user access allowed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_P</name>
                  <description>Secure and Priviledge user access allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXCOMM3_RULE</name>
              <description>no description available</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_NS_NP</name>
                  <description>Non-secure and Non-priviledge user access allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_P</name>
                  <description>Non-secure and Privilege access allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_NP</name>
                  <description>Secure and Non-priviledge user access allowed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_P</name>
                  <description>Secure and Priviledge user access allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXCOMM4_RULE</name>
              <description>no description available</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_NS_NP</name>
                  <description>Non-secure and Non-priviledge user access allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_P</name>
                  <description>Non-secure and Privilege access allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_NP</name>
                  <description>Secure and Non-priviledge user access allowed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_P</name>
                  <description>Secure and Priviledge user access allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAILBOX_RULE</name>
              <description>no description available</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_NS_NP</name>
                  <description>Non-secure and Non-priviledge user access allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_P</name>
                  <description>Non-secure and Privilege access allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_NP</name>
                  <description>Secure and Non-priviledge user access allowed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_P</name>
                  <description>Secure and Priviledge user access allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO0_RULE</name>
              <description>High Speed GPIO</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_NS_NP</name>
                  <description>Non-secure and Non-priviledge user access allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_P</name>
                  <description>Non-secure and Privilege access allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_NP</name>
                  <description>Secure and Non-priviledge user access allowed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_P</name>
                  <description>Secure and Priviledge user access allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_CTRL_AHB1_0_SLAVE_RULE</name>
          <description>Security access rules for AHB peripherals.</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_HS_DEV_RULE</name>
              <description>USB high Speed device registers</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_NS_NP</name>
                  <description>Non-secure and Non-priviledge user access allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_P</name>
                  <description>Non-secure and Privilege access allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_NP</name>
                  <description>Secure and Non-priviledge user access allowed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_P</name>
                  <description>Secure and Priviledge user access allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRC_RULE</name>
              <description>CRC engine</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_NS_NP</name>
                  <description>Non-secure and Non-priviledge user access allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_P</name>
                  <description>Non-secure and Privilege access allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_NP</name>
                  <description>Secure and Non-priviledge user access allowed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_P</name>
                  <description>Secure and Priviledge user access allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXCOMM5_RULE</name>
              <description>no description available</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_NS_NP</name>
                  <description>Non-secure and Non-priviledge user access allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_P</name>
                  <description>Non-secure and Privilege access allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_NP</name>
                  <description>Secure and Non-priviledge user access allowed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_P</name>
                  <description>Secure and Priviledge user access allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXCOMM6_RULE</name>
              <description>no description available</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_NS_NP</name>
                  <description>Non-secure and Non-priviledge user access allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_P</name>
                  <description>Non-secure and Privilege access allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_NP</name>
                  <description>Secure and Non-priviledge user access allowed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_P</name>
                  <description>Secure and Priviledge user access allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
