zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/LPC55S69/LPC55S69_cm33_core0.xml
        <register>
          <name>SEC_GPIO_MASK0</name>
          <description>Secure GPIO mask for port 0 pins. This register is used to block leakage of Secure interface (GPIOs, I2C, UART configured as secure peripherals) pin states to non-secure world.</description>
          <addressOffset>0xF80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIO0_PIN0_SEC_MASK</name>
              <description>0 : Pin PIO0_0 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN1_SEC_MASK</name>
              <description>0 : Pin PIO0_1 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN2_SEC_MASK</name>
              <description>0 : Pin PIO0_2 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN3_SEC_MASK</name>
              <description>0 : Pin PIO0_3 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN4_SEC_MASK</name>
              <description>0 : Pin PIO0_4 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN5_SEC_MASK</name>
              <description>0 : Pin PIO0_5 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN6_SEC_MASK</name>
              <description>0 : Pin PIO0_6 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN7_SEC_MASK</name>
              <description>0 : Pin PIO0_7 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN8_SEC_MASK</name>
              <description>0 : Pin PIO0_8 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN9_SEC_MASK</name>
              <description>0 : Pin PIO0_9 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN10_SEC_MASK</name>
              <description>0 : Pin PIO0_10 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN11_SEC_MASK</name>
              <description>0 : Pin PIO0_11 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN12_SEC_MASK</name>
              <description>0 : Pin PIO0_12 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN13_SEC_MASK</name>
              <description>0 : Pin PIO0_13 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN14_SEC_MASK</name>
              <description>0 : Pin PIO0_14 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN15_SEC_MASK</name>
              <description>0 : Pin PIO0_15 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN16_SEC_MASK</name>
              <description>0 : Pin PIO0_16 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN17_SEC_MASK</name>
              <description>0 : Pin PIO0_17 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN18_SEC_MASK</name>
              <description>0 : Pin PIO0_18 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN19_SEC_MASK</name>
              <description>0 : Pin PIO0_19 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN20_SEC_MASK</name>
              <description>0 : Pin PIO0_20 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN21_SEC_MASK</name>
              <description>0 : Pin PIO0_21 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN22_SEC_MASK</name>
              <description>0 : Pin PIO0_22 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN23_SEC_MASK</name>
              <description>0 : Pin PIO0_23 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN24_SEC_MASK</name>
              <description>0 : Pin PIO0_24 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN25_SEC_MASK</name>
              <description>0 : Pin PIO0_25 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN26_SEC_MASK</name>
              <description>0 : Pin PIO0_26 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN27_SEC_MASK</name>
              <description>0 : Pin PIO0_27 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN28_SEC_MASK</name>
              <description>0 : Pin PIO0_28 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN29_SEC_MASK</name>
              <description>0 : Pin PIO0_29 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN30_SEC_MASK</name>
              <description>0 : Pin PIO0_30 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO0_PIN31_SEC_MASK</name>
              <description>0 : Pin PIO0_31 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_GPIO_MASK1</name>
          <description>Secure GPIO mask for port 1 pins.</description>
          <addressOffset>0xF84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIO1_PIN0_SEC_MASK</name>
              <description>0 : Pin PIO1_0 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN1_SEC_MASK</name>
              <description>0 : Pin PIO1_1 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN2_SEC_MASK</name>
              <description>0 : Pin PIO1_2 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN3_SEC_MASK</name>
              <description>0 : Pin PIO1_3 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN4_SEC_MASK</name>
              <description>0 : Pin PIO1_4 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN5_SEC_MASK</name>
              <description>0 : Pin PIO1_5 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN6_SEC_MASK</name>
              <description>0 : Pin PIO1_6 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN7_SEC_MASK</name>
              <description>0 : Pin PIO1_7 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN8_SEC_MASK</name>
              <description>0 : Pin PIO1_8 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN9_SEC_MASK</name>
              <description>0 : Pin PIO1_9 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN10_SEC_MASK</name>
              <description>0 : Pin PIO1_10 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN11_SEC_MASK</name>
              <description>0 : Pin PIO1_11 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN12_SEC_MASK</name>
              <description>0 : Pin PIO1_12 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN13_SEC_MASK</name>
              <description>0 : Pin PIO1_13 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN14_SEC_MASK</name>
              <description>0 : Pin PIO1_14 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN15_SEC_MASK</name>
              <description>0 : Pin PIO1_15 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN16_SEC_MASK</name>
              <description>0 : Pin PIO1_16 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN17_SEC_MASK</name>
              <description>0 : Pin PIO1_17 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN18_SEC_MASK</name>
              <description>0 : Pin PIO1_18 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN19_SEC_MASK</name>
              <description>0 : Pin PIO1_19 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN20_SEC_MASK</name>
              <description>0 : Pin PIO1_20 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN21_SEC_MASK</name>
              <description>0 : Pin PIO1_21 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN22_SEC_MASK</name>
              <description>0 : Pin PIO1_22 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN23_SEC_MASK</name>
              <description>0 : Pin PIO1_23 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN24_SEC_MASK</name>
              <description>0 : Pin PIO1_24 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN25_SEC_MASK</name>
              <description>0 : Pin PIO1_25 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN26_SEC_MASK</name>
              <description>0 : Pin PIO1_26 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN27_SEC_MASK</name>
              <description>0 : Pin PIO1_27 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN28_SEC_MASK</name>
              <description>0 : Pin PIO1_28 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN29_SEC_MASK</name>
              <description>0 : Pin PIO1_29 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN30_SEC_MASK</name>
              <description>0 : Pin PIO1_30 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN31_SEC_MASK</name>
              <description>0 : Pin PIO1_31 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
