zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/LPC55S69/LPC55S69_cm33_core0.xml
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>no description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>no description available</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PVTVF0_RED_IRQ</name>
              <description>PVT Monitor 0 (Process/Voltage/Temperature) Red interrupt</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>no description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>no description available</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PVTVF1_AMBER_IRQ</name>
              <description>PVT Monitor 1 (Process/Voltage/Temperature) Amber interrupt</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>no description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>no description available</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PVTVF1_RED_IRQ</name>
              <description>PVT Monitor 1 (Process/Voltage/Temperature) Red interrupt</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>no description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>no description available</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_MASK_LOCK</name>
          <description>Security General Purpose register access control.</description>
          <addressOffset>0xFBC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xAAA</resetValue>
          <resetMask>0xFFF</resetMask>
          <fields>
            <field>
              <name>SEC_GPIO_MASK0_LOCK</name>
              <description>2'b10: SEC_GPIO_MASK0 can be written. All other values: sec_reg_reg0 can't be written.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_GPIO_MASK1_LOCK</name>
              <description>2'b10: SEC_GPIO_MASK1 can be written. All other values: sec_reg_reg1 can't be written.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_GPIO_MASK2_LOCK</name>
              <description>2'b10: SEC_GPIO_MASK2 can be written. All other values: sec_reg_reg2 can't be written.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_GPIO_MASK3_LOCK</name>
              <description>2'b10: SEC_GPIO_MASK3 can be written. All other values: sec_reg_reg3 can't be written.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_CPU1_INT_MASK0_LOCK</name>
              <description>2'b10: SEC_CPU1_INT_MASK0 can be written. All other values: sec_reg_reg4 can't be written.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_CPU1_INT_MASK1_LOCK</name>
              <description>2'b10: SEC_CPU1_INT_MASK1 can be written. All other values: sec_reg_reg5 can't be written.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MASTER_SEC_LEVEL</name>
          <description>master secure level register</description>
          <addressOffset>0xFD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MCM33C</name>
              <description>Micro-CM33 (CPU1) Code bus.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCM33S</name>
              <description>Micro-CM33 (CPU1) System bus.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBFSD</name>
              <description>USB Full Speed Device.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDMA0</name>
              <description>System DMA 0.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EZH_D</name>
              <description>EZH Data.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EZH_I</name>
              <description>EZH instruction.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO</name>
              <description>SDIO.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PQ</name>
              <description>Power Quad.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HASH</name>
              <description>Hash.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBFSH</name>
              <description>USB Full speed Host.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDMA1</name>
              <description>System DMA 1 security level.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASTER_SEC_LEVEL_LOCK</name>
              <description>master_sec_reg write-lock. When 2'b10, this register can be written. With any other value, this register can't be written.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MASTER_SEC_ANTI_POL_REG</name>
          <description>master secure level anti-pole register</description>
          <addressOffset>0xFD4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xBFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MCM33C</name>
              <description>Micro-CM33 (CPU1) Code bus. Must be equal to NOT(MASTER_SEC_LEVEL.MCM33C)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCM33S</name>
              <description>Micro-CM33 (CPU1) System bus. Must be equal to NOT(MASTER_SEC_LEVEL.MCM33S)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBFSD</name>
              <description>USB Full Speed Device. Must be equal to NOT(MASTER_SEC_LEVEL.USBFSD)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDMA0</name>
              <description>System DMA 0. Must be equal to NOT(MASTER_SEC_LEVEL.SDMA0)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EZH_D</name>
              <description>EZH Data. Must be equal to NOT(MASTER_SEC_LEVEL.EZH_D)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EZH_I</name>
              <description>EZH instruction. Must be equal to NOT(MASTER_SEC_LEVEL.EZH_I)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO</name>
              <description>SDIO. Must be equal to NOT(MASTER_SEC_LEVEL.SDIO)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PQ</name>
              <description>Power Quad. Must be equal to NOT(MASTER_SEC_LEVEL.PQ)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HASH</name>
              <description>Hash. Must be equal to NOT(MASTER_SEC_LEVEL.HASH)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBFSH</name>
              <description>USB Full speed Host. Must be equal to NOT(MASTER_SEC_LEVEL.USBFSH)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDMA1</name>
              <description>System DMA 1 security level. Must be equal to NOT(MASTER_SEC_LEVEL.SDMA1)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASTER_SEC_LEVEL_ANTIPOL_LOCK</name>
              <description>master_sec_antipol_reg register write-lock. When 2'b10, this register can be written. With any other value, this register can't be written.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM33_LOCK_REG</name>
          <description>Miscalleneous control signals for in CM33 (CPU0)</description>
          <addressOffset>0xFEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x800002AA</resetValue>
          <resetMask>0xC00003FF</resetMask>
          <fields>
            <field>
              <name>LOCK_NS_VTOR</name>
              <description>2'b10: CM33 (CPU0) LOCKNSVTOR is 0. All other values: CM33 (CPU0) LOCKNSVTOR is 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_NS_MPU</name>
              <description>2'b10: CM33 (CPU0) LOCKNSMPU is 0. All other values: CM33 (CPU0) LOCKNSMPU is 1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_S_VTAIRCR</name>
              <description>2'b10: CM33 (CPU0) LOCKSVTAURCR is 0. All other values: CM33 (CPU0) LOCKSVTAURCR is 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_S_MPU</name>
              <description>2'b10: CM33 (CPU0) LOCKSMPU is 0. All other values: CM33 (CPU0) LOCKSMPU is 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_SAU</name>
              <description>2'b10: CM33 (CPU0) LOCKSAU is 0. All other values: CM33 (CPU0) LOCKSAU is 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CM33_LOCK_REG_LOCK</name>
              <description>2'b10: this register can be written. All other values: this register can't be written</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCM33_LOCK_REG</name>
          <description>Miscalleneous control signals for in micro-CM33 (CPU1)</description>
          <addressOffset>0xFF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8000000A</resetValue>
          <resetMask>0xC000000F</resetMask>
          <fields>
            <field>
              <name>LOCK_NS_VTOR</name>
              <description>2'b10: micro-CM33 (CPU1) LOCKNSVTOR is 0. All other values: micro-CM33 (CPU1) LOCKNSVTOR is 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_NS_MPU</name>
              <description>2'b10: micro-CM33 (CPU1) LOCKNSMPU is 0. All other values: micro-CM33 (CPU1) LOCKNSMPU is 1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCM33_LOCK_REG_LOCK</name>
              <description>2'b10: this register can be written. All other values: this register can't be written</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC_CTRL_DP_REG</name>
          <description>secure control duplicate register</description>
          <addressOffset>0xFF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xAAAA</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>WRITE_LOCK</name>
              <description>write lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_SECURE_CHECKING</name>
              <description>AHB bus matrix enable secure checking. 10: disabled. All other values: enabled (restrictive mode)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_S_PRIV_CHECK</name>
              <description>AHB bus matrix enable secure privilege check</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_NS_PRIV_CHECK</name>
              <description>AHB bus matrix enable non-secure privilege check</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLE_VIOLATION_ABORT</name>
              <description>Disable secure violation abort</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLE_SIMPLE_MASTER_STRICT_MODE</name>
              <description>00, 11, 10 = Simple master in strict mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLE_SMART_MASTER_STRICT_MODE</name>
              <description>00, 11, 10 = Smart masters in strict mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDAU_ALL_NS</name>
              <description>00, 11, 10 : IDAU is enabled</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC_CTRL_REG</name>
          <description>secure control register</description>
          <addressOffset>0xFFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xAAAA</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>WRITE_LOCK</name>
              <description>write lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_SECURE_CHECKING</name>
              <description>AHB bus matrix enable secure checking. 10: disabled. All other values: enabled (restrictive mode)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_S_PRIV_CHECK</name>
              <description>AHB bus matrix enable secure privilege check</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_NS_PRIV_CHECK</name>
              <description>AHB bus matrix enable non-secure privilege check</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLE_VIOLATION_ABORT</name>
              <description>Disable secure violation abort</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLE_SIMPLE_MASTER_STRICT_MODE</name>
              <description>00, 11, 10 = Simple master in strict mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLE_SMART_MASTER_STRICT_MODE</name>
              <description>00, 11, 10 = Smart masters in strict mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDAU_ALL_NS</name>
              <description>00, 11, 10 : IDAU is enabled</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>